xzcvczx/mla-legacy/mTouchCapDemos/PIC24F_Demos/mTouchCap_DA210_GraphicsDemo/ResTouchScreen.c
/*****************************************************************************
 *
 * Simple 4 wire touch screen driver
 *
 *****************************************************************************
 * FileName:        TouchScreen.c
 * Dependencies:    TouchScreen.h
 * Processor:       PIC24, PIC32, dsPIC, PIC24H
 * Compiler:       	MPLAB C30, MPLAB C32
 * Linker:          MPLAB LINK30, MPLAB LINK32
 * Company:         Microchip Technology Incorporated
 *
 * Software License Agreement
 *
 * Copyright © 2008 Microchip Technology Inc.  All rights reserved.
 * Microchip licenses to you the right to use, modify, copy and distribute
 * Software only when embedded on a Microchip microcontroller or digital
 * signal controller, which is integrated into your product or third party
 * product (pursuant to the sublicense terms in the accompanying license
 * agreement).  
 *
 * You should refer to the license agreement accompanying this Software
 * for additional information regarding your rights and obligations.
 *
 * SOFTWARE AND DOCUMENTATION ARE PROVIDED “AS IS” WITHOUT WARRANTY OF ANY
 * KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY
 * OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR
 * PURPOSE. IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR
 * OBLIGATED UNDER CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION,
 * BREACH OF WARRANTY, OR OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT
 * DAMAGES OR EXPENSES INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL,
 * INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA,
 * COST OF PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY
 * CLAIMS BY THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF),
 * OR OTHER SIMILAR COSTS.
 *
 * Author               Date        Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Anton Alkhimenok		01/08/07	...
 * Anton Alkhimenok		06/06/07	Basic calibration and GOL messaging are added
 * Anton Alkhimenok     02/05/08    new PICtail support, portrait orientation is added
 * Sean Justice         02/07/08    PIC32 support
 * Anton Alkhimenok     05/27/08    More robust algorithm
 * Anton Alkhimenok     01/07/09    Graphics PICtail Version 3 support is added
 * Jayanth Murthy       06/25/09    dsPIC & PIC24H support 
 * PAT					06/29/09	Added event EVENT_STILLPRESS to support continuous press
 * Microchip			04/15/10	Qualified EVENT_STILLPRESS to be set only when
 *                                  an actual touch is occuring.
 *                                  Removed timer and timer ISR, made the touch detection
 *                                  a function.
 *****************************************************************************/
#include "ResTouchScreen.h"


extern int CapmTouchIdle;
//////////////////////// LOCAL PROTOTYPES ////////////////////////////
void    TouchGetCalPoints(void);

#define WAIT_UNTIL_FINISH(x)    while(!x)

//////////////////////// GLOBAL VARIABLES ////////////////////////////
#define PRESS_THRESHOULD    350 //256 // between 0-0x03ff the lesser this value the lighter the screen must be pressed

    // Max/Min ADC values for each derection
volatile WORD   	_calXMin = XMINCAL;
volatile WORD       _calXMax = XMAXCAL;
volatile WORD       _calYMin = YMINCAL;
volatile WORD       _calYMax = YMAXCAL;

// Current ADC values for X and Y channels
volatile SHORT      adcX = -1;
volatile SHORT      adcY = -1;
volatile SHORT      adcPot = 0;

typedef enum
{
    SET_X,
    RUN_X,
    GET_X,
    RUN_CHECK_X,
    CHECK_X,
    SET_Y,
    RUN_Y,
    GET_Y,
    CHECK_Y,
    SET_VALUES,
    GET_POT,
    RUN_POT
} TOUCH_STATES;

volatile TOUCH_STATES state = SET_X;


void TouchProcessTouch(void)
{
    static SHORT    tempX, tempY;
    SHORT           temp;

    switch(state)
    {

         case SET_X:
            AD1CHS = ADC_XPOS;      // switch ADC channel
            TRIS_XPOS = 1;
            TRIS_YPOS = 1;
            TRIS_XNEG = 1;
            LAT_YNEG = 0;
            TRIS_YNEG = 0;

			IFS0bits.AD1IF = 0;
            AD1CON1bits.SAMP = 1;
			Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();
            AD1CON1bits.SAMP = 0;   // run conversion
			while(!IFS0bits.AD1IF);
			IFS0bits.AD1IF = 0;

            state = CHECK_X;
            //break;

        case CHECK_X:
            if((WORD) PRESS_THRESHOULD > (WORD) ADC1BUF0)
            {
              	LAT_YPOS = 1;
               	TRIS_YPOS = 0;
               	tempX = -1;
               	state = RUN_X;
            }
            else	//no touch
            {
                adcX = -1;
                adcY = -1;
           		state = SET_X;	
            }
			break;

        case RUN_X:
  			IFS0bits.AD1IF = 0;
            AD1CON1bits.SAMP = 1;
			Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();
            AD1CON1bits.SAMP = 0;   // run conversion
			while(!IFS0bits.AD1IF);
			IFS0bits.AD1IF = 0;

            temp = ADC1BUF0;
            if(temp != tempX)
            {
                tempX = temp;
                state = RUN_X;
                break;
            }
           	TRIS_YPOS = 1;
            state =  GET_X;
			break;

        case GET_X:
 
  			IFS0bits.AD1IF = 0;
            AD1CON1bits.SAMP = 1;
			Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();
            AD1CON1bits.SAMP = 0;   // run conversion
			while(!IFS0bits.AD1IF);
			IFS0bits.AD1IF = 0;

            if((WORD) PRESS_THRESHOULD < (WORD) ADC1BUF0)
            {
                adcX = -1;
                adcY = -1;
               	state = SET_X;
                break;
            }

            AD1CHS = ADC_YPOS;      // switch ADC channel
            TRIS_XPOS = 1;
            TRIS_YPOS = 1;
            LAT_XNEG = 0;
            TRIS_XNEG = 0;
            TRIS_YNEG = 1;
			state = SET_Y;
			break;

        case SET_Y:
   			IFS0bits.AD1IF = 0;
            AD1CON1bits.SAMP = 1;
			Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();Nop();
            AD1CON1bits.SAMP = 0;   // run conversion
			while(!IFS0bits.AD1IF);
			IFS0bits.AD1IF = 0;

            state = CHECK_Y;

